{
  "name": "SAT.1 BALL CREATOR",
  "description": "Der SAT.1 BALL CREATOR ist eine interaktive, webbasierte 3D-Anwendung zur Erstellung und Animation einer stilisierten Kugel, die visuell an das ikonische \"Sat.1\"-Design (den bunten Ball) angelehnt ist. Die Anwendung nutzt modernste Web-Technologien (React, Three.js via React Three Fiber), um Echtzeit-Rendering im Browser zu ermöglichen.\nHauptfunktionen & Features:\nDynamische 3D-Geometrie:\nDer Ball besteht aus einzelnen, vertikalen Lamellen (Slices).\nVolle Kontrolle: Der Nutzer kann die Anzahl der Lamellen, deren Breite (in Grad), den vertikalen Start- und Endwinkel sowie die Tiefe der Lamellen (Kern-Radius) stufenlos anpassen.\nEin innerer Kern ist separat konfigurierbar.\nFortschrittliche Animationen:\nPhysische Rotation: Der Ball dreht sich um die Y-Achse (Geschwindigkeit und Richtung einstellbar).\nOrganische Bewegung: Verschiedene Modi wie \"Atmen\" (gleichmäßiges Pulsieren) oder \"Welle\" (versetztes Pulsieren der Lamellen) sorgen für Lebendigkeit.\n\"Lauflicht\"-Effekt (Color Rotation): Eine spezielle Funktion lässt die Farben weich und flüssig über die stehenden oder sich drehenden Lamellen wandern, was hochdynamische visuelle Effekte ermöglicht.\nMaterial & Optik:\nPhysically Based Rendering (PBR): Realistische Materialeigenschaften.\nEinstellungen: Rauheit (Matte/Glanz), Metall-Effekt, Clearcoat (Lackschicht), Transmission (Glas/Transparenz) und Irideszenz (Regenbogen-Schimmer).\nStil-Presets: Vorgefertigte Lichtstimmungen wie \"Studio\", \"Cyberpunk\" (Neon) und \"Sunset\".\nPost-Processing (Nachbearbeitung):\nIntegrierte Effekte für cineastische Looks: Bloom (Leuchteffekt), Film Grain (Körnung) und Chromatische Aberration (Glitch/Farbverschiebung).\nInteraktivität:\nHover-Effekt: Beim Überfahren mit der Maus leuchten einzelne Lamellen weiß auf.\nUI-Overlay: Ein umfangreiches Konfigurationspanel ermöglicht die Echtzeit-Steuerung aller Parameter (Farben, Animation, Geometrie, Umgebung).\nDieses Tool eignet sich hervorragend für Motion-Design-Prototyping, als interaktiver Marken-Showcase oder als technisches Demo für leistungsfähige 3D-Webgrafiken.",
  "requestFramePermissions": []
}